blog/notes/trash_talk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-29 Tue 22:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>垃圾話</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">垃圾話</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">會議室裡遺失的東西</a></li>
<li><a href="#orgheadline2">笑即是殘酷</a></li>
<li><a href="#orgheadline3">生存、質疑與事故</a></li>
<li><a href="#orgheadline4">四句話總結人的一生</a></li>
<li><a href="#orgheadline5">JavaScript 帶給人類的啟示</a></li>
<li><a href="#orgheadline6">為什麼幸福的家庭都一個樣? 不幸的家庭都不一樣？</a></li>
<li><a href="#orgheadline7">空虛與複雜</a></li>
<li><a href="#orgheadline8">矛盾何來</a></li>
<li><a href="#orgheadline9">一無所有</a></li>
<li><a href="#orgheadline10">跟工科大學生談生涯規劃</a></li>
<li><a href="#orgheadline11">公司來了新人，姓蔡</a></li>
<li><a href="#orgheadline12">Duck Typing</a></li>
<li><a href="#orgheadline13">熱情與初戀</a></li>
<li><a href="#orgheadline14">阿宅都很忙</a></li>
<li><a href="#orgheadline15">要改的地方太多</a></li>
<li><a href="#orgheadline16">註定失敗</a></li>
<li><a href="#orgheadline17">那就改天</a></li>
<li><a href="#orgheadline18">大學專題該做什麼</a></li>
<li><a href="#orgheadline19">耐看</a></li>
<li><a href="#orgheadline20">品味</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">會議室裡遺失的東西</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
K: 「有同學在會議室裡遺失重要的東西嗎？」
</p>

<p>
A: 「青春。」
</p>

<p>
source: bobchao's facebook.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">笑即是殘酷</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Mikimoto: 根據幸福守恆定律，有生物笑的時候，一定有生物倒楣，所以笑的人都很殘酷。
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">生存、質疑與事故</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
Mikimoto: 所有的事情都會分成三個階段：「生存、質疑與世故」，例如以吃飯來說，一剛開始，你會告訴自己要吃飯，之後你會問為什麼要吃飯，最後你會問自己還有什麼東西可以吃
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">四句話總結人的一生</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
喜歡上一個人
</p>

<p>
喜歡上一個人
</p>

<p>
喜歡上一個人
</p>

<p>
喜歡上一個人
</p>

<p>
source: <a href="https://t.co/JQBvV4Hb2R">https://t.co/JQBvV4Hb2R</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">JavaScript 帶給人類的啟示</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
javascript 告訴我們一件事，本身優不優秀不重要，重點是生對地方&#x2026;.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">為什麼幸福的家庭都一個樣? 不幸的家庭都不一樣？</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
幸福的家庭都一個樣，不幸的家庭則家家有本難念的經。
</p>

<p>
為什麼呢？
</p>

<p>
讓工程師來告訴你：幸福的判斷式是 &amp;&amp;，不幸的判斷式是 ||；同時滿足所有條件才能變成幸福家庭，任一條件不滿足都會變成不幸家庭。
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">空虛與複雜</h2>
<div class="outline-text-2" id="text-orgheadline7">
<p>
小孩的精神很豐富，所以他們的玩具很簡單。
</p>

<p>
大人的玩具很複雜，所以他們的精神很空虛。
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">矛盾何來</h2>
<div class="outline-text-2" id="text-orgheadline8">
<p>
矛盾何來，皆因製杖販劍
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">一無所有</h2>
<div class="outline-text-2" id="text-orgheadline9">
<p>
不要再說你一無所有了，你不是有病嗎？
</p>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10">跟工科大學生談生涯規劃</h2>
<div class="outline-text-2" id="text-orgheadline10">
<p>
友人問曰: 「要跟大學生講職場、生涯規劃，大家覺得應該講些什麼」？
</p>

<p>
有鄉民答曰: 「工程師怎麼娶到好老婆的」
</p>

<p>
再有鄉民答曰: 「30歲前討到好老婆不能不知道的30件事」
</p>

<p>
友人妻奇道: 「所以取老婆比較重要？」
</p>

<p>
另有鄉民回道 :「娶對，就是人生。 娶錯，就是殘生。」
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">公司來了新人，姓蔡</h2>
<div class="outline-text-2" id="text-orgheadline11">
<p>
男的叫蔡比巴, 女的叫菜菜子
</p>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Duck Typing</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
什麼叫做 duck typing, 只要這個女生化妝起來像正妹，修圖後像正妹，整形後像正妹，那她就是個正妹。
</p>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">熱情與初戀</h2>
<div class="outline-text-2" id="text-orgheadline13">
<p>
Pingooo: 熱情就像初戀，一旦失去了，就很難追回來
</p>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14">阿宅都很忙</h2>
<div class="outline-text-2" id="text-orgheadline14">
<p>
Jserv: 要說多少次，阿宅們都很忙碌的呀，不會因為居家就會很有空
</p>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15">要改的地方太多</h2>
<div class="outline-text-2" id="text-orgheadline15">
<p>
Clkao: 要改的地方太多了，就改天
</p>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16">註定失敗</h2>
<div class="outline-text-2" id="text-orgheadline16">
<p>
「從什麼時候開始決定你的人生注定失敗？」
</p>

<p>
『呃，當精子的時候？』
</p>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17">那就改天</h2>
<div class="outline-text-2" id="text-orgheadline17">
<p>
改天就是永遠沒有那一天
</p>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18">大學專題該做什麼</h2>
<div class="outline-text-2" id="text-orgheadline18">
<p>
Cindy: 專題就做 Lambda 仿生獸吧!
</p>

<p>
大二生: 這東西能做什麼用。
</p>

<p>
Cindy: 學生專題就是要做沒用但有梗的東西，要做有用能賺錢的東西，你之後的機會很多。
</p>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19">耐看</h2>
<div class="outline-text-2" id="text-orgheadline19">
<p>
攝影師: 妳長得很耐看，但我沒有耐性
</p>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20">品味</h2>
<div class="outline-text-2" id="text-orgheadline20">
<p>
何謂品味？何謂有追求？
</p>

<p>
就是讓一小部分有錢的人看出來你很有錢
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Hsin-Yi</p>
<p class="date">Created: 2016-03-29 Tue 22:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
